app/controllers/expenses_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
---
  def edit
    @expense = Expense.find(params[:id])
    @users_expense = []
    @expense.users.each do |user|

SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
---
  def create
    user = current_user
    if not user.has_role? :admin or not params[:expense][:creator_id]
      params[:expense][:creator_id] = user.id
    end
    params[:expense][:user_ids] ||= []

    if not params[:expense][:user_ids].include? params[:expense][:creator_id]
      params[:expense][:user_ids].push(params[:expense][:creator_id])
    end
    @expense = Expense.new(params[:expense])

    respond_to do |format|
      if @expense.save
        flash[:notice] = 'Expense was successfully created.'
        format.html { redirect_to(:action=>'index') }
        format.xml  { render :xml => @expense, :status => :created, :location => @expense }
        format.js {
          build_table User.find current_user