app/controllers/expensegroups_controller.rb

SELECT * FROM "expensegroups"
---
  def index
    @expensegroups = Expensegroup.all

SELECT * FROM "expensegroups" WHERE ("expensegroups"."id" = 1)
---
  def show
    @expensegroup = Expensegroup.find(params[:id])

SELECT * FROM "expensegroups" WHERE ("expensegroups"."id" = 1)
SELECT "users".id FROM "users" INNER JOIN "expensegroups_users" ON "users".id = "expensegroups_users".user_id WHERE ("expensegroups_users".expensegroup_id = 1 )
---
  def edit
    @expensegroup = Expensegroup.find(params[:id])
    @users_expensegroup = []
    @expensegroup.users.each do |user|

SELECT * FROM "expensegroups" WHERE ("expensegroups"."id" = 1)
UPDATE "expensegroups" SET "updated_at" = '2009-12-03 17:36:05', "disabled" = 'f' WHERE "id" = 1
---
  def update
    @expensegroup = Expensegroup.find(params[:id])

    respond_to do |format|
      if @expensegroup.update_attributes(params[:expensegroup])