app/controllers/expenses_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "expensegroups" INNER JOIN "expensegroups_users" ON "expensegroups".id = "expensegroups_users".expensegroup_id WHERE ("expensegroups_users".user_id = 1 )
SELECT * FROM "expenses" WHERE ((expensegroup_id in (NULL)) AND (reference_date > '2009-11-03 17:05:30')) ORDER BY reference_date DESC
SELECT count(*) AS count_all FROM "expenses" WHERE (expensegroup_id in (1,3,4,5,6,7,8,9,10,11,13,14,15,16,17,18,19,20))
---
  def index
    @user = User.find session[:user_id]
    @expensegroups = @user.expensegroups
    @totals = calculate_total_for Expense.last_month.related_to_group(@expensegroups)

    @expense = Expense.new :reference_date => Date.today
    @expenses = Expense.related_to_group(@expensegroups).paginate :all, :page => params[:page]

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "expensegroups" INNER JOIN "expensegroups_users" ON "expensegroups".id = "expensegroups_users".expensegroup_id WHERE ("expensegroups_users".user_id = 1 )
SELECT * FROM "expenses" WHERE ((expensegroup_id in (1,3,4,5,6,7,8,9,10,11,13,14,15,16,17,18,19,20,21,22,23,24)) AND (reference_date > '2009-04-29 15:00:00 UTC' and reference_date < '2010-02-27 00:00:00 UTC')) ORDER BY reference_date DESC LIMIT 15 OFFSET 0
SELECT count(*) AS count_all FROM "expenses" WHERE ((expensegroup_id in (1,3,4,5,6,7,8,9,10,11,13,14,15,16,17,18,19,20,21,22,23,24)) AND (reference_date > '2009-04-29 15:00:00 UTC' and reference_date < '2010-02-27 00:00:00 UTC'))
---
  def filter
    @user = User.find session[:user_id]
    @expensegroups = @user.expensegroups
    @totals = calculate_total_for Expense.last_month.related_to_group(@expensegroups)
    @from = params[:expense][:from]
    @to = params[:expense][:to]

    @expense = Expense.new :reference_date => Date.today
    @expenses = Expense.between(@from,@to).related_to_group(@expensegroups).paginate :all, :page => params[:page]

SELECT * FROM "expenses" WHERE ("expenses"."id" = 1) ORDER BY reference_date DESC
---
  def show
    @expense = Expense.find(params[:id])

SELECT * FROM "expenses" WHERE ("expenses"."id" = 1) ORDER BY reference_date DESC
---
  def edit
    @expense = Expense.find(params[:id])

INSERT INTO "expenses" ("workflow", "created_at", "notes", "updated_at", "amount", "personal_id", "creator_id", "reference_date", "category_id", "description", "status", "expensegroup_id") VALUES(NULL, '2009-12-03 17:37:27', 'carote e cipolle', '2009-12-03 17:37:27', 145.0, NULL, 2, '2009-12-03 17:37:03', 2, 'spesa match', NULL, 1)
---
  def create
    user = current_user
    if not user.has_role? :admin or not params[:expense][:creator_id]
      params[:expense][:creator_id] = user.id
    end
    @expense = Expense.new(params[:expense])

    respond_to do |format|
      if @expense.save

SELECT * FROM "expenses" WHERE ("expenses"."id" = 10) ORDER BY reference_date DESC
UPDATE "expenses" SET "updated_at" = '2009-12-03 19:15:18', "reference_date" = '2010-01-14 00:00:00' WHERE "id" = 10
---
  def update
    @expense = Expense.find(params[:id])

    respond_to do |format|
      if @expense.update_attributes(params[:expense])