app/controllers/report_controller.rb

SELECT * FROM "users" INNER JOIN "expensegroups_users" ON "users".id = "expensegroups_users".user_id WHERE ("expensegroups_users".expensegroup_id = 1 )
---
  def expense_report
    @user = current_user
    if params[:id].to_i != 0
      @year = params[:id].to_i
    else
      @year = Date.today.year
    end
    if params.keys.include? :start_date
      start_date = params[:start_date]
    else
      start_date = Date.new y = @year, m=1, d=1
    end
    end_date = start_date + 1.year
    @expenses = Expense.related_to_user(current_user).between(start_date, end_date)
    @monthly_expense = {}
    for ex in @expenses
      key = ex.reference_date.month# "#{ex.reference_date.month}-#{ex.reference_date.year}"
      if not @monthly_expense.keys.include? key
        @monthly_expense[key] = 0
      end
      @monthly_expense[key] += ex.amount / ex.users.length