app/controllers/users_controller.rb

INSERT INTO "users" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('', 'b8b1dc249dcf379ca1fec6d13070f5b22e4e2518', '2009-12-03 17:10:17', '355d078ed534eab9c383f97fccdf182830fbcb37', NULL, '2009-12-03 17:10:17', NULL, 'alessia', 'alessia@gmail.com')
---
  def create
    @user = User.new(params[:user])
    success = @user && @user.save